<a href="https://colab.research.google.com/github/nak4hara/freecodecamp_data_analysis/blob/main/freecodecamp_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [10]:
import pandas as pd

url_dados = 'https://github.com/ine-rmotr-curriculum/freecodecamp-intro-to-pandas/raw/master/data/btc-market-price.csv'

In [11]:
dados = pd.read_csv(url_dados, header=None)
dados

                       0            1
0    2017-04-02 00:00:00  1099.169125
1    2017-04-03 00:00:00  1141.813000
2    2017-04-04 00:00:00  1141.600363
3    2017-04-05 00:00:00  1133.079314
4    2017-04-06 00:00:00  1196.307937
..                   ...          ...
360  2018-03-28 00:00:00  7960.380000
361  2018-03-29 00:00:00  7172.280000
362  2018-03-30 00:00:00  6882.531667
363  2018-03-31 00:00:00  6935.480000
364  2018-04-01 00:00:00  6794.105000

[365 rows x 2 columns]

In [12]:
dados.head()

                     0            1
0  2017-04-02 00:00:00  1099.169125
1  2017-04-03 00:00:00  1141.813000
2  2017-04-04 00:00:00  1141.600363
3  2017-04-05 00:00:00  1133.079314
4  2017-04-06 00:00:00  1196.307937

In [14]:
dados.columns = ['Timestamp', 'Price']
dados.head()

             Timestamp        Price
0  2017-04-02 00:00:00  1099.169125
1  2017-04-03 00:00:00  1141.813000
2  2017-04-04 00:00:00  1141.600363
3  2017-04-05 00:00:00  1133.079314
4  2017-04-06 00:00:00  1196.307937

In [16]:
dados.shape

(365, 2)

In [17]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Timestamp  365 non-null    object
 1   Price      365 non-null    float64
dtypes: float64(1), object(1)
memory usage: 5.8+ KB

In [18]:
dados.dtypes

Timestamp     object
Price        float64
dtype: object

In [21]:
dados['Timestamp'] = pd.to_datetime(dados['Timestamp']).head()
dados.head()

   Timestamp        Price
0 2017-04-02  1099.169125
1 2017-04-03  1141.813000
2 2017-04-04  1141.600363
3 2017-04-05  1133.079314
4 2017-04-06  1196.307937

In [22]:
dados.dtypes

Timestamp    datetime64[ns]
Price               float64
dtype: object

In [23]:
dados.set_index('Timestamp', inplace= True)

In [33]:
dados.head()

                  Price
Timestamp
2017-04-02  1099.169125
2017-04-03  1141.813000
2017-04-04  1141.600363
2017-04-05  1133.079314
2017-04-06  1196.307937

In [34]:
 dados.loc['2017-04-04']

                  Price
Timestamp
2017-04-04  1141.600363

In [36]:
data = pd.read_csv(
    url_dados,
    header= None,
    names= ['Timestamp', 'Price'],
    index_col=0,
    parse_dates= True
)
#Just needed this instead of all ahead
data.head()

                  Price
Timestamp
2017-04-02  1099.169125
2017-04-03  1141.813000
2017-04-04  1141.600363
2017-04-05  1133.079314
2017-04-06  1196.307937